import asyncio
import ollama
from aiogram import types, F, Router
from bot import bot
from rag.chroma import search_in_db
from rag.llm import expand_query
from config import CHAT_MODEL

router = Router()

# Хендлер для обычных вопросов (RAG)
@router.message(F.text)
async def handle_question(message: types.Message):
    user_text = message.text
    await bot.send_chat_action(chat_id=message.chat.id, action="typing")

    # 1. Расширяем запрос (делаем это в потоке, чтобы не блокировать бота)
    expanded_query = await asyncio.to_thread(expand_query, user_text)
    print(f"DEBUG: Оригинал: '{user_text}' -> Расширенный: '{expanded_query}'")

    # 2. Ищем в базе уже по РАСШИРЕННОМУ запросу
    found_text, meta = await asyncio.to_thread(search_in_db, expanded_query)

    if not found_text:
        await message.answer("🤷‍♂️ Я пока не знаю ответа. Попробуй скинуть мне статью на эту тему.")
        return

    # 3. Формируем ответ (подаем оригинальный вопрос для контекста)
    prompt = f"""
    Ты — аналитик данных. Твоя задача — ответить на вопрос, опираясь ИСКЛЮЧИТЕЛЬНО на приведенный ниже контекст.
    Контекст может содержать несколько отрывков из разных источников.

    Инструкция:
    1. Сначала найди в тексте цитаты, подтверждающие ответ.
    2. Если информации нет, честно напиши: "В базе знаний нет информации".
    3. Сформулируй краткий и четкий ответ на основе найденных фактов.

    Контекст:
    {found_text}

    Вопрос: {user_text}
    """

    response = ollama.chat(model=CHAT_MODEL, messages=[{'role': 'user', 'content': prompt}],
        options={
            'temperature': 0.1,  # Минимум фантазии
            'num_ctx': 8192  # Больше памяти
        }
    )

    answer = response['message']['content']

    # Проверка: если бот отказался отвечать
    refusal_phrases = ["нет информации", "не знаю", "не найдено", "затрудняюсь ответить"]
    # Проверяем, есть ли стоп-фраза в начале ответа (в нижнем регистре)
    is_refusal = any(phrase in answer.lower() for phrase in refusal_phrases)

    if is_refusal:
        # Если бот не знает, просто отправляем текст без ссылки
        await message.answer(answer)
    else:
        # Если ответил по делу - добавляем источник
        full_answer = f"{answer}\n\n📚 *Источник:* [{meta['title']}]({meta['url']})"
        await message.answer(full_answer, parse_mode="Markdown")